SoapRequest/PartyVerificationPerson.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:par="http://hollard.co.za/PartyVerificationService/" xmlns:par1="http://hollard.co.za/Schema/Types/Party">
   <soapenv:Header />
   <soapenv:Body>
      <par:ScreenAndVerifyParty xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
         <par:ScreenAndVerifyOperationType>ScreenAndVerify</par:ScreenAndVerifyOperationType>
         <par:PartyList>
            <par1:Party i:type="par1:Person">
               <par1:GivenName>Maary DPIP</par1:GivenName>
               <par1:Surname>Diederics</par1:Surname>
               <par1:IdentityNumber>
                  <par1:IdentityType>NationalIdentityNumber</par1:IdentityType>
                  <par1:IdentityNumber>6310025637080</par1:IdentityNumber>
                  <par1:IssueCountry>RSA</par1:IssueCountry>
               </par1:IdentityNumber>
               <par1:HomePhysicalAddress>
                  <par1:AddressLine1>VLAEBERG ROAD</par1:AddressLine1>
                  <par1:AddressLine2>LYNEDOCH</par1:AddressLine2>
                  <par1:AddressLine3>STELLENBOSCH</par1:AddressLine3>
               </par1:HomePhysicalAddress>
            </par1:Party>
         </par:PartyList>
         <par:Channel>Digital</par:Channel>
         <par:Product>Life</par:Product>
         <par:AnnualPremium>10000</par:AnnualPremium>
         <par:ExternalReference>a690bc08-26e8-92a2-7314-7aa22078b748</par:ExternalReference>
         <par:MaxCacheAge>0</par:MaxCacheAge>
      </par:ScreenAndVerifyParty>
   </soapenv:Body>
</soapenv:Envelope>